---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterValueRule
source: html/d238014d-907d-a6ce-342c-3956f6f6692e.htm
---
# FilterValueRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.